/*
题号：0603_2        题目:计算n*n矩阵主对角线上的元素之和        得分：0  
  
作业提交截止时间：2020/11/30 0:00:00	 
 	
题目内容：
从键盘上输入正整数n(n<11)，再输入n*n矩阵的元素，计算其主对角线上元素之和。
例：
（1）输入：
3
1 2 3 4 5 6 7 8 9  
输出：sum=15
（2）输入：
10
1 2 3 4 5 6 7 8 9 10
11 12 13 14 15 16 17 18 19 20
21 22 23 24 25 26 27 28 29 30
31 32 33 34 35 36 37 38 39 40
41 42 43 44 45 46 47 48 49 50
51 52 53 45 55 56 57 58 59 60
61 62 63 64 65 66 67 68 69 70
71 72 73 74 75 76 77 78 79 80
81 82 83 84 85 86 87 88 89 90
91 92 93 94 95 96 97 98 99 100
输出：sum=505

*/


#include<stdio.h>
#define N 11

int main()
{
    int i,j,n,sum=0,matrix[N][N];
    
    scanf("%d",&n);
    for(i=0;i<n;i++)
    {
        for(j=0;j<n;j++)
        {
            scanf("%d",&matrix[i][j]);
        }
    }

    for(i=0;i<n;i++)
    {
        sum+=matrix[i][i];
    }

    printf("sum=%d",sum);
    return 0;
}