/*	题号：0412        题目:求圆塔及附近区域内某一点的高度        得分：0  
  
作业提交截止时间：2020/11/5 23:59:00	 
 	
题目内容：
有4个圆塔，圆心分别为(2,2) (-2,2) (-2,-2) (2,-2)，圆半径为1。这4个塔的高度为10m，塔以外无建筑。今输入任一点的坐标，求该点的建筑高度（塔外的高度为0）。
例：
（1）输入：0,0 输出：h=0m
（2）输入：1.9,2.1 输出：h=10m
（3）输入：2,-1 输出：h=10m
（4）输入：-2,2.3 输出：h=10m
（5）输入：-2,-1.1 输出：h=10m
（6）输入：1.9,3.1 输出：h=0m
*/
#include<stdio.h>
#include<math.h>
int main(){
	double d1,d2,d3,d4,r=1,x,y;
	int h;
	scanf("%lf,%lf",&x,&y);
	d1=sqrt(pow(x-2,2)+pow(y-2,2));
	d2=sqrt(pow(x+2,2)+pow(y-2,2));
	d3=sqrt(pow(x+2,2)+pow(y+2,2));
	d4=sqrt(pow(x-2,2)+pow(y+2,2));
	if (d1<=r||d2<=r||d3<=r||d4<=r) h=10;
		else h=0;
	printf("h=%dm",h);
	return 0;
} 

