/*
     C语言程序设计	 
题号：L0717        题目:输出1到n的阶乘        得分：0  
  
作业提交截止时间：2020/12/20 0:00:00	 
 	
题目内容：
从键盘上输入n(要求n<=20)，输出1到n的阶乘。
注：可能会用到64位整型数据，用法如下图所示。
例：
（1）输入：20
输出：
1!=1
2!=2
3!=6
4!=24
5!=120
6!=720
7!=5040
8!=40320
9!=362880
10!=3628800
11!=39916800
12!=479001600
13!=6227020800
14!=87178291200
15!=1307674368000
16!=20922789888000
17!=355687428096000
18!=6402373705728000
19!=121645100408832000
20!=2432902008176640000

可能用到__int64
*/
#include<stdio.h>

__int64 fac(int n)
{
    static __int64 f=1;
    return f=f*n;
}

int main()
{
    int i,n;
    scanf("%d",&n);
    for(i=1;i<=n;i++)
    {
        printf("%d!=%I64d\n",i,fac(i));
    }
    return 0;
}