/*题号：B0508        题目:a+2b=n(固定的数)        得分：0  
  
作业提交截止时间：2020/11/29 0:00:00	 
	
题目内容：
输入一个正整数n（n>=3），满足条件：a+2b=n。其中a与b是两个正整数，且a<=b。
请输出"a+2*b=n"的所有情况，每种情况占一行。
例：
（1）输入：3  输出：1+2*1=3
（2）输入：10  输出：2+2*4=10
（3）输入：17  输出：
1+2*8=17
3+2*7=17
5+2*6=17
*/
#include<stdio.h>
int main(){
	int a,b,n,i;
	scanf("%d",&n);
	b=i=n/2;
	//printf("b=%d\n",b);
	for(a=1;b>0;b--){
		a=1;
		//printf("一层循环a=%d,b=%d,n=%d\n",a,b,n);
		for(a=1;a<=b;a++){
			//printf("a=%d,b=%d,n=%d\n",a,b,n);
			if ((a+2*b)==n){
				printf("%d+2*%d=%d\n",a,b,n);
			} 
		}
	}
	return 0;
}
